app/controllers/articles_controller.rb

	def index
		# Rerieve all articles from model.
		@articles = Article.all
---
SELECT "articles".* FROM "articles"

	def create
		# Shows parameters and values on page.
		# render plain: params[:article].inspect

		# Attributes of model are mapped to db columns.
		@article = Article.new(article_params)

		# If save model in db is true.
		if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "11111111"], ["text", "dddddddd"], ["created_at", "2018-03-19 20:08:50.388998"], ["updated_at", "2018-03-19 20:08:50.388998"]]

	def update
		@article = Article.find(params[:id])

		if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "three"], ["text", "1111"], ["updated_at", "2018-03-16 03:44:30.314618"], ["id", 3]]