app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "andy"], ["body", "accwVwvw"], ["article_id", 4], ["created_at", "2018-03-22 04:02:44.060054"], ["updated_at", "2018-03-22 04:02:44.060054"]]
---
	def create
		@article = Article.find(params[:articel_id])
		@comment = @article.comments.create(comment_params)